In this video we will learn how to apply Python's pre-built and self-built functions to pandas data object. We will also learn about applying functions to a pandas series and pandas DataFrame.

In [1]:
from google.colab import drive
drive.mount('/content/drive')

Mounted at /content/drive

In [2]:
%cd /content/drive/My Drive/Colab Notebooks

/content/drive/My Drive/Colab Notebooks

In [3]:
import pandas as pd
data = pd.read_csv('data-titanic.csv')

In [4]:
data.head()

   PassengerId  Survived  Pclass  ...     Fare Cabin  Embarked
0            1         0       3  ...   7.2500   NaN         S
1            2         1       1  ...  71.2833   C85         C
2            3         1       3  ...   7.9250   NaN         S
3            4         1       1  ...  53.1000  C123         S
4            5         0       3  ...   8.0500   NaN         S

[5 rows x 12 columns]

Let's proceed to applying functions using pandas' apply method. In this example we wil create a function using lambda.

In [6]:
func_lower = lambda x: x.lower()

Here we pass a value x and converting it into lowercase. We then apply this function to the Name field in the dataset using the apply() method.

In [7]:
data.Name.apply(func_lower)

0                                braund, mr. owen harris
1      cumings, mrs. john bradley (florence briggs th...
2                                 heikkinen, miss. laina
3           futrelle, mrs. jacques heath (lily may peel)
4                               allen, mr. william henry
                             ...
886                                montvila, rev. juozas
887                         graham, miss. margaret edith
888             johnston, miss. catherine helen "carrie"
889                                behr, mr. karl howell
890                                  dooley, mr. patrick
Name: Name, Length: 891, dtype: object

If you loook closely, the values in the Name field have been converted into lowercase. Next, we see how to apply functions to values in multiple columns or a whole DataFrame. We can use the applymap() method for this. It works in a fashion similar to apply() method but on multiple columns or on the whole DataFrame.

In [9]:
import numpy as np

data[['Age','Pclass']].applymap(np.square)

        Age  Pclass
0     484.0       9
1    1444.0       1
2     676.0       9
3    1225.0       1
4    1225.0       9
..      ...     ...
886   729.0       4
887   361.0       1
888     NaN       9
889   676.0       1
890  1024.0       9

[891 rows x 2 columns]

Now let's create our own function  and then apply it to the values.

In [10]:
def my_func(i):
  return i + 20

The function that was create is a simple function that takes a value, adds 20 to it and then returns the result. We use apply map() to apply this function to every value in the Age and Pclass columns

In [11]:
data[['Age','Pclass']].applymap(my_func)

      Age  Pclass
0    42.0      23
1    58.0      21
2    46.0      23
3    55.0      21
4    55.0      23
..    ...     ...
886  47.0      22
887  39.0      21
888   NaN      23
889  46.0      21
890  52.0      23

[891 rows x 2 columns]